[
  {
    "group_number": 0,
    "sub-number": 1,
    "group_label": "requirements",
    "sub_group": "content",
    "comment_keyword": "length",
    "comment_text": "The length requirement for this assignment is 1500 words, excluding MLA documentation and other paraphernalia. This paper is too short to sustain a fully-researched, well-developed, and well-supported scholarly analysis. Due to the brevity of your paper, the argument it contains falls short of the level required for a higher score."
  },
  {
    "group_number": 0,
    "sub-number": 1,
    "group_label": "requirements",
    "sub_group": "content",
    "comment_keyword": "paragraphs",
    "comment_text": "Each body paragraph should have a clear topic sentence that relates back to the thesis. The information in each paragraph should relate to the topic sentence."
  },
  {
    "group_number": 0,
    "sub-number": 1,
    "group_label": "requirements",
    "sub_group": "content",
    "comment_keyword": "summary",
    "comment_text": "You should avoid unnecessary biographical information and plot summary. Your paper should be an analysis of the text."
  },
  {
    "group_number": 0,
    "sub-number": 1,
    "group_label": "requirements",
    "sub_group": "content",
    "comment_keyword": "thesis",
    "comment_text": "Your thesis statement must be clearly worded, make a claim, and be supported throughout your paper. The thesis statement should be the last sentence in your introductory paragraph."
  },
  {
    "group_number": 0,
    "sub-number": 1,
    "group_label": "requirements",
    "sub_group": "content",
    "comment_keyword": "summary",
    "comment_text": "You should avoid unnecessary biographical information and plot summary. Your paper should be an analysis of the text."
  },
  {
    "group_number": 0,
    "sub-number": 1,
    "group_label": "requirements",
    "sub_group": "content",
    "comment_keyword": "POV",
    "comment_text": "As you analyze the information, make sure you employ a consistent third person point of view. Do not use first or second person pronouns."
  },
  {
    "group_number": 0,
    "sub-number": 1,
    "group_label": "requirements",
    "sub_group": "content",
    "comment_keyword": "mechanics",
    "comment_text": "All written assignments should be mechanically and grammatically correct with proper punctuation. Proofread, have a friend look over your paper, and/or seek help from a tutor to iron out the mechanics and conventions of your writing."
  },
  {
    "group_number": 0,
    "sub-number": 2,
    "group_label": "requirements",
    "sub_group": "MLA",
    "comment_keyword": "types & num.",
    "comment_text": "You needed to cite at least five secondary sources that provide critical arguments about the text(s) you have chosen. These sources should ONLY come from the GMC on-campus library or GMC online library databases. JSOR is preferred. You also need to cite the primary text(s) you are analyzing."
  },
  {
    "group_number": 0,
    "sub-number": 2,
    "group_label": "requirements",
    "sub_group": "MLA",
    "comment_keyword": "format",
    "comment_text": "Your paper must be formatted according to MLA format. That means font style, font weight, margins, line spacing, justification, etc. Reference the course documents and the Owl at Purdue for details."
  },
  {
    "group_number": 0,
    "sub-number": 2,
    "group_label": "requirements",
    "sub_group": "MLA",
    "comment_keyword": "in-text",
    "comment_text": "You must include MLA in-text citations to document each quote, paraphrase, or detail taken from your primary or secondary sources. Your MLA in-text citations could use some work."
  },
  {
    "group_number": 0,
    "sub-number": 2,
    "group_label": "requirements",
    "sub_group": "MLA",
    "comment_keyword": "works cited",
    "comment_text": "The works-cited page is its own page at the end of your paper. Your works-cited should cite all your secondary sources as well as the primary text you have chosen."
  },
  {
    "group_number": 1,
    "sub-number": 1,
    "group_label": "organization",
    "sub_group": "arrangement",
    "comment_keyword": "arrangement",
    "comment_text": "Your essay must consist of ideas that logically progress from one to the other. As of right now, your essay is lacking in this area. See if you can organize your thoughts into well-developed paragraphs that proceed evenly from each other."
  },
  {
    "group_number": 1,
    "sub-number": 1,
    "group_label": "organization",
    "sub_group": "arrangement",
    "comment_keyword": "movement",
    "comment_text": "The distribution of ideas in your essay is uneven and at times, seems slapdash or haphazard. Next time, try to even things out with a clearer organization and a more logical sequencing of your ideas."
  },
  {
    "group_number": 1,
    "sub-number": 1,
    "group_label": "organization",
    "sub_group": "arrangement",
    "comment_keyword": "sequence",
    "comment_text": "The sequencing of ideas in this essay is confusing for the reader. Think about ways you can order your thoughts to achieve the utmost clarity and precision."
  },
  {
    "group_number": 1,
    "sub-number": 1,
    "group_label": "organization",
    "sub_group": "introduction",
    "comment_keyword": "introduction",
    "comment_text": "The introduction is meant to serve as a kind of preview or outline of the main points to come in your essay. Go back and look at your introduction; it is not really serving this purpose. Try to come up with a \"hook\" to get the reader's attention, and follow this up with a clear outline of the main ideas of the rest of your essay."
  },
  {
    "group_number": 1,
    "sub-number": 2,
    "group_label": "organization",
    "sub_group": "introduction",
    "comment_keyword": "begin question",
    "comment_text": "Beginning an essay with a question is a sign of weak or lower-level writing. I know you can do better than this."
  },
  {
    "group_number": 1,
    "sub-number": 2,
    "group_label": "organization",
    "sub_group": "introduction",
    "comment_keyword": "begin quote",
    "comment_text": "Do not begin your essay, a paragraph, or any sentence with a quotation mark. Quotes need more context, lead-in, and explanation than can be given in an introduction."
  },
  {
    "group_number": 1,
    "sub-number": 2,
    "group_label": "organization",
    "sub_group": "introduction",
    "comment_keyword": "hook",
    "comment_text": "Most readers decide whether or not they will continue reading a paper after the first couple of sentences. Draw your reader in with a hook to grab his or her attention and to ensure he or she keeps reading your work."
  },
  {
    "group_number": 1,
    "sub-number": 3,
    "group_label": "organization",
    "sub_group": "thesis",
    "comment_keyword": "overstuffed",
    "comment_text": "I know that it can seem important to stuff all your big ideas into your thesis, but this makes it so that it is hard for your reader to follow you. Pare down your thesis for clarity's sake and focus on the main point of your essay."
  },
  {
    "group_number": 1,
    "sub-number": 3,
    "group_label": "organization",
    "sub_group": "thesis",
    "comment_keyword": "position",
    "comment_text": "Remember to place your thesis statement at the end of your introduction so that it frames the rest of your essay for your reader."
  },
  {
    "group_number": 1,
    "sub-number": 3,
    "group_label": "organization",
    "sub_group": "thesis",
    "comment_keyword": "sharpen",
    "comment_text": "Spend more time honing and perfecting your thesis. Your thesis statement must be clear and arguable and supported throughout your paper."
  },
  {
    "group_number": 1,
    "sub-number": 3,
    "group_label": "organization",
    "sub_group": "thesis",
    "comment_keyword": "too broad",
    "comment_text": "Narrow down your thesis so that your reader gets a better sense of the main points of your paper. Think of your thesis as a tool to define the main ideas and sub-ideas presented in your essay."
  },
  {
    "group_number": 1,
    "sub-number": 3,
    "group_label": "organization",
    "sub_group": "thesis",
    "comment_keyword": "wording",
    "comment_text": "Your thesis is the most important sentence of your essay, so be sure that it is easy to understand. Use simpler and more fluid language to get your point across to the reader."
  },
  {
    "group_number": 1,
    "sub-number": 4,
    "group_label": "organization",
    "sub_group": "paragraphs",
    "comment_keyword": "paragraphs",
    "comment_text": "All ideas in a paragraph should be logically linked together. Start with a strong topic sentence and then introduce supporting sentences to provide more detail and flesh out this initial idea."
  },
  {
    "group_number": 1,
    "sub-number": 4,
    "group_label": "organization",
    "sub_group": "paragraphs",
    "comment_keyword": "details",
    "comment_text": "Flesh out your paragraphs by providing more supporting evidence. As you have done the research on this topic, you are the expert, but remember to explain it more fully so that the reader can understand."
  },
  {
    "group_number": 1,
    "sub-number": 4,
    "group_label": "organization",
    "sub_group": "paragraphs",
    "comment_keyword": "overstuffed",
    "comment_text": "Readers can get easily overwhelmed at immense blocks of text. Break down your ideas into more digestible bite-size chunks. You do not want your good ideas to get lost because there is too much contained in one paragraph."
  },
  {
    "group_number": 1,
    "sub-number": 4,
    "group_label": "organization",
    "sub_group": "paragraphs",
    "comment_keyword": "quotes long",
    "comment_text": "Avoid using long quotes over four lines like this. Paraphrase sections if this if necessary, but quotes that are too long bog down otherwise effective prose. I am interested in your ability to write and to analyze, not in your ability to copy and paste."
  },
  {
    "group_number": 1,
    "sub-number": 4,
    "group_label": "organization",
    "sub_group": "paragraphs",
    "comment_keyword": "topic sentences",
    "comment_text": "Think of your topic sentence as a kind of mini-thesis. As your thesis statement presents the main idea of your entire paper, so your topic sentence should present the main idea of that entire paragraph. Strengthen your topic sentences so that they accurately take control of the rest of the paragraph."
  },
  {
    "group_number": 1,
    "sub-number": 4,
    "group_label": "organization",
    "sub_group": "paragraphs",
    "comment_keyword": "undernourished",
    "comment_text": "Most ideas are too complex to develop in four sentences or less. To make a paragraph complete, it must have a strong topic sentence, a good amount of evidence, analysis of that evidence, and a strong link to the next paragraph. Flesh out any paragraphs that are four sentences or less by adding missing elements."
  },
  {
    "group_number": 2,
    "sub-number": 1,
    "group_label": "content",
    "sub_group": "analysis",
    "comment_keyword": "analysis",
    "comment_text": "Your paper lacks analytical depth. Be conscientious and work to break down your argument into its most basic parts, then provided a detailed explanation of how they fit back together again."
  },
  {
    "group_number": 2,
    "sub-number": 1,
    "group_label": "content",
    "sub_group": "analysis",
    "comment_keyword": "critical thinking",
    "comment_text": "Critical thinking is of the utmost importance in writing and in all academia, and here you have failed to live up to this standard. I needed you to show me that you were capable of drawing nuanced conclusions, so next time, be certain to think more critically and deeply."
  },
  {
    "group_number": 2,
    "sub-number": 1,
    "group_label": "content",
    "sub_group": "analysis",
    "comment_keyword": "details",
    "comment_text": "In one or more of your analyses, you started off well and I was excited to read what you had to say. However, your argument fell short when you failed to provide ample supporting details from the text and/or outside sources. Be sure to adequately flesh out all your ideas and arguments so that they live up to the high standards of college scholarship."
  },
  {
    "group_number": 2,
    "sub-number": 1,
    "group_label": "content",
    "sub_group": "analysis",
    "comment_keyword": "focus",
    "comment_text": "Just because an essay attempts to do a lot does not necessarily mean it is well-written. In fact, it is usually the opposite. Narrow your scope so you can analyze this topic more effectively; it is too hard to take everything into consideration when you go too broad."
  },
  {
    "group_number": 2,
    "sub-number": 1,
    "group_label": "content",
    "sub_group": "analysis",
    "comment_keyword": "poor analysis",
    "comment_text": "Your paper did not reach the analytical depth I was hoping for. Get to the bottom of this topic and dismantle it into its constituent parts, then reconstruct those parts to show how they combine to make a whole."
  },
  {
    "group_number": 2,
    "sub-number": 1,
    "group_label": "content",
    "sub_group": "analysis",
    "comment_keyword": "off thesis",
    "comment_text": "If you decide midway through your paper to write on a different topic, you must edit your thesis statement accordingly. Writing your thesis statement on one topic and the body of your essay on another comes across as slapdash and haphazard."
  },
  {
    "group_number": 2,
    "sub-number": 1,
    "group_label": "content",
    "sub_group": "analysis",
    "comment_keyword": "off topic",
    "comment_text": "You seem to have written this essay largely off-topic. One of the most foundational skills of good writing is following directions. Hew closely at all times to the assigned topic and read directions carefully to avoid losing points."
  },
  {
    "group_number": 2,
    "sub-number": 1,
    "group_label": "content",
    "sub_group": "analysis",
    "comment_keyword": "simplify",
    "comment_text": "Try to avoid language that is too flowery or syntax that is too complicated. Oftentimes, the best sentences are short, direct, and to the point (think Hemingway). Revise as needed to give your reader a better sense of clarity."
  },
  {
    "group_number": 2,
    "sub-number": 1,
    "group_label": "content",
    "sub_group": "analysis",
    "comment_keyword": "so what?",
    "comment_text": "When analyzing literature, always answer the question \"so what?\" This calls upon you to examine not just what happened, but why it happened, why it matters, and what it means. Rochester has a madwoman locked in his attic. So what? What conclusion, meaning, or truth can we glean from that fact? What does that detail reveal about the theme of the piece, the psychology of its characters, or how the work applies to our world today?"
  },
  {
    "group_number": 2,
    "sub-number": 1,
    "group_label": "content",
    "sub_group": "analysis",
    "comment_keyword": "summary",
    "comment_text": "Take great care not to devolve into summary rather than analysis. Summary is a low-level writing and thinking skill, and I needed you to proceed to analysis. Do not tell us what something is; tell us why something is."
  },
  {
    "group_number": 2,
    "sub-number": 2,
    "group_label": "content",
    "sub_group": "research",
    "comment_keyword": "research",
    "comment_text": "A research paper is meant to be objective. Think of it like a newspaper. You are not meant to editorialize; instead, simply report the facts. You strayed away from this format in this essay."
  },
  {
    "group_number": 2,
    "sub-number": 2,
    "group_label": "content",
    "sub_group": "research",
    "comment_keyword": "evidence",
    "comment_text": "This essay was not meant to be an opinion piece. You need facts to back up your assertions. As of right now, you do not have adequate source material to substantiate your claims."
  },
  {
    "group_number": 2,
    "sub-number": 2,
    "group_label": "content",
    "sub_group": "research",
    "comment_keyword": "fact errors",
    "comment_text": "Misreporting factual information calls into question the integrity of your question as a whole. This is a serious error. Be sure to check all facts you include in your writing."
  },
  {
    "group_number": 2,
    "sub-number": 2,
    "group_label": "content",
    "sub_group": "research",
    "comment_keyword": "objectivity",
    "comment_text": "Much like The New York Times prides itself on objective reporting, so should you. You have too much personal bias in this writing. There is a time and a place for that, and this is not it. Stick to the facts."
  },
  {
    "group_number": 2,
    "sub-number": 2,
    "group_label": "content",
    "sub_group": "research",
    "comment_keyword": "opinion",
    "comment_text": "Be very clear in distinguishing facts from opinions. Readers can tell when a writer is trying to present an opinion as a fact, and vice versa. Maintain a clear separation between facts (which can be proven) and opinions (which cannot be proven) at all times to avoid damaging your authority as a writer."
  },
  {
    "group_number": 2,
    "sub-number": 2,
    "group_label": "content",
    "sub_group": "research",
    "comment_keyword": "sources req",
    "comment_text": "Your argument could benefit from more high-level, scholarly, peer-reviewed source material. More sources could further validate your case."
  },
  {
    "group_number": 3,
    "sub-number": 1,
    "group_label": "mechanics",
    "sub_group": "punctuation",
    "comment_keyword": "apostrophe",
    "comment_text": "You have used one or more apostrophes incorrectly here. Apostrophes are used for two purposes - omission and possession - but be careful to keep their usages straight."
  },
  {
    "group_number": 3,
    "sub-number": 1,
    "group_label": "mechanics",
    "sub_group": "punctuation",
    "comment_keyword": "capitalization",
    "comment_text": "A proper noun is a specific noun and it needs to be capitalized. For instance, \"Uncle Jerry\" is a specific uncle, and thus his name is capitalized. Simple nouns, however, are non-specific and do not need to be capitalized. An example of this would be \"my uncle."
  },
  {
    "group_number": 3,
    "sub-number": 1,
    "group_label": "mechanics",
    "sub_group": "punctuation",
    "comment_keyword": "colon",
    "comment_text": "Generally, colons are used to set up a series, expand a statement, or emphasize a point, but if you want to use one, you must make sure there is an independent clause before the colon."
  },
  {
    "group_number": 3,
    "sub-number": 1,
    "group_label": "mechanics",
    "sub_group": "punctuation",
    "comment_keyword": "dash",
    "comment_text": "Use dashes much as you would parentheses. Just keep in mind that a dash is two hyphens with NO spaces. \"I like to use punctuation--like dashes--when I write."
  },
  {
    "group_number": 3,
    "sub-number": 1,
    "group_label": "mechanics",
    "sub_group": "punctuation",
    "comment_keyword": "ellipsis",
    "comment_text": "An ellipsis is meant to show omission or a pause in dialogue and can be quite an effective writing tool. However, make sure you are actually using an ellipsis and not random dots. An ellipsis is four spaces and three equally spaced periods. \"I mean . . . it is just that . . . I really want you to learn how to use an ellipsis."
  },
  {
    "group_number": 3,
    "sub-number": 1,
    "group_label": "mechanics",
    "sub_group": "punctuation",
    "comment_keyword": "hyphen",
    "comment_text": "Hyphens connect compound words, like \"well-written.\" Keep in mind you do not need to use hyphens for -ly adverbs like, \"Marcia was quickly-running."
  },
  {
    "group_number": 3,
    "sub-number": 1,
    "group_label": "mechanics",
    "sub_group": "punctuation",
    "comment_keyword": "mechanics",
    "comment_text": "Mechanical errors can be quite distracting for your reader, and you have made a number of them throughout this essay. While your ideas may be quite solid, they are masked by your poor mechanical usage, such as inappropriate verb tense, improper grammar, or weak vocabulary. Please review basic rules in these areas before your next paper."
  },
  {
    "group_number": 3,
    "sub-number": 1,
    "group_label": "mechanics",
    "sub_group": "punctuation",
    "comment_keyword": "proofread",
    "comment_text": "Proofreading your own paper can be difficult. I understand this. Nevertheless, your paper would have benefited greatly from some careful proofreading. Because we can often be blind to our own mistakes, try to find a friend or classmate who will read over your paper for you to catch any careless mistakes."
  },
  {
    "group_number": 3,
    "sub-number": 1,
    "group_label": "mechanics",
    "sub_group": "punctuation",
    "comment_keyword": "punctuation",
    "comment_text": "Punctuation may be somewhat dry, but it is still a very important skill to conquer. Please review the available literature on punctuation or speak to a tutor to improve your skills in this area."
  },
  {
    "group_number": 3,
    "sub-number": 1,
    "group_label": "mechanics",
    "sub_group": "punctuation",
    "comment_keyword": "quotes",
    "comment_text": "There are a lot of rules to keep straight with punctuation, but when it comes to quotation marks, just remember that commas and periods go inside quotation marks. All other marks (question marks, exclamation points, semicolons, etc.) go outside the quotation marks unless they were part of the original quotation."
  },
  {
    "group_number": 3,
    "sub-number": 1,
    "group_label": "mechanics",
    "sub_group": "punctuation",
    "comment_keyword": "semicolon",
    "comment_text": "You have used a semicolon incorrectly here. Semicolons are only appropriate when there is an independent clause (full sentence) on either side."
  },
  {
    "group_number": 3,
    "sub-number": 2,
    "group_label": "mechanics",
    "sub_group": "commas",
    "comment_keyword": "commas",
    "comment_text": "You have one or more misplaced commas here, which can be incredibly distracting for the reader. Please go back and review the basic rules to avoid this mistake in the future."
  },
  {
    "group_number": 3,
    "sub-number": 2,
    "group_label": "mechanics",
    "sub_group": "commas",
    "comment_keyword": "coordinate adj.",
    "comment_text": "If you have two adjectives side-by-side and you can insert an \"and\" between them, you must use a comma to separate those adjectives. For instance, \"My dog has a dark, curly coat."
  },
  {
    "group_number": 3,
    "sub-number": 2,
    "group_label": "mechanics",
    "sub_group": "commas",
    "comment_keyword": "introductory",
    "comment_text": "You do not separate your introductory clause from the rest of a sentence with a comma here. You must do this to properly punctuate your sentence and indicate to your reader that you have a strong grasp on mechanical rules and usage. For instance, \"In order to cook well, you need good equipment."
  },
  {
    "group_number": 3,
    "sub-number": 2,
    "group_label": "mechanics",
    "sub_group": "commas",
    "comment_keyword": "restrictive",
    "comment_text": "Before your next assignment, please review the rules for restrictive and non-restrictive comma usage. This is one of the most frequently misunderstood comma rules, but studying and internalizing it will help you a great deal."
  },
  {
    "group_number": 3,
    "sub-number": 2,
    "group_label": "mechanics",
    "sub_group": "commas",
    "comment_keyword": "run-on",
    "comment_text": "If you connect two independent clauses with a conjunction (for, and, nor, but, or, yet, so), you must include a comma before the conjunction as well. If you do not do this, you will have a run-on sentence. For instance, \"Maria likes to cook, and Bob likes to eat."
  },
  {
    "group_number": 3,
    "sub-number": 2,
    "group_label": "mechanics",
    "sub_group": "commas",
    "comment_keyword": "series",
    "comment_text": "When you include items in a series, you need to separate those items using commas. \"I like to run, swim, and hike."
  },
  {
    "group_number": 3,
    "sub-number": 2,
    "group_label": "mechanics",
    "sub_group": "commas",
    "comment_keyword": "which",
    "comment_text": "That vs. which is a tricky rule, but let's go over the basics. \"Which\" generally sets up a non-restrictive clause, and so it needs a comma before it. \"That,\" on the other hand, generally sets up a restrictive clause, and so does not need a comma."
  },
  {
    "group_number": 3,
    "sub-number": 3,
    "group_label": "mechanics",
    "sub_group": "grammar",
    "comment_keyword": "diction",
    "comment_text": "I was disappointed in the words and language you used in this paper. I think that you are capable of using a higher level of vocabulary. Avoid slang at all costs and consider using a thesaurus to vary your word choice."
  },
  {
    "group_number": 3,
    "sub-number": 3,
    "group_label": "mechanics",
    "sub_group": "grammar",
    "comment_keyword": "agreement",
    "comment_text": "Watch out for number agreement errors. Make sure you use plural and singular words correctly."
  },
  {
    "group_number": 3,
    "sub-number": 3,
    "group_label": "mechanics",
    "sub_group": "grammar",
    "comment_keyword": "compound words",
    "comment_text": "Compound words can be confusing, but be sure that you connect words and use hyphens correctly. If you need help on a specific word, the dictionary is a great resource."
  },
  {
    "group_number": 3,
    "sub-number": 3,
    "group_label": "mechanics",
    "sub_group": "grammar",
    "comment_keyword": "contractions",
    "comment_text": "Do not use contractions. Please take the time to say \"do not\" instead of \"do not,\" for example. Contractions are too colloquial for this level of college academics."
  },
  {
    "group_number": 3,
    "sub-number": 3,
    "group_label": "mechanics",
    "sub_group": "grammar",
    "comment_keyword": "numbers",
    "comment_text": "Spell out numbers one through ninety-nine. Anything bigger than that can be written in numerals. Always use numerals for dates, times, comparisons, figures, decimals, percentages, and money. Never start a sentence with a numeral figure (i.e. 1, 2%, 5:00pm, etc.)."
  },
  {
    "group_number": 3,
    "sub-number": 3,
    "group_label": "mechanics",
    "sub_group": "grammar",
    "comment_keyword": "pronoun vague",
    "comment_text": "Vague pronoun usage is an easy trap to fall into, and unfortunately, you have done it here. Limit your pronoun usage and always make sure that when you do use a pronoun, that pronoun's antecedent is very clear."
  },
  {
    "group_number": 3,
    "sub-number": 3,
    "group_label": "mechanics",
    "sub_group": "grammar",
    "comment_keyword": "pronoun I",
    "comment_text": "Do not use personal pronouns such as I, me, we, us, and you. Make sure you employ a consistent third person point of view. Do not use first or second person pronouns."
  },
  {
    "group_number": 3,
    "sub-number": 3,
    "group_label": "mechanics",
    "sub_group": "grammar",
    "comment_keyword": "spelling",
    "comment_text": "Spelling errors in your final draft are costly mistakes. Make full use of spell check and have a friend to proofread your paper to correct any errors you did not catch."
  },
  {
    "group_number": 3,
    "sub-number": 3,
    "group_label": "mechanics",
    "sub_group": "grammar",
    "comment_keyword": "tense",
    "comment_text": "You have made one or more verb tense errors in this piece of writing. Verb tense errors seem sloppy and confusing and damage your authority with your reader. Proofread carefully to ensure that you are using past tense verbs for things that happened in the past, future tense verbs for things that will happen, and present tense verbs for things that are currently happening."
  },
  {
    "group_number": 3,
    "sub-number": 3,
    "group_label": "mechanics",
    "sub_group": "grammar",
    "comment_keyword": "verb form",
    "comment_text": "You have one or more errors in verb form usage here. Always be conscientious of who is performing the action and in what tense you are writing so you know which verb tense to use."
  },
  {
    "group_number": 3,
    "sub-number": 3,
    "group_label": "mechanics",
    "sub_group": "grammar",
    "comment_keyword": "wrong word",
    "comment_text": "Throughout this essay, there were places where you used the wrong word. Using the wrong word damages your credibility with the writer. Be sure you understand the meaning of each word you use and check to make sure you are using the right form of easily confused words (your/you are, there/their/they're, etc.)."
  },
  {
    "group_number": 3,
    "sub-number": 4,
    "group_label": "mechanics",
    "sub_group": "sentences",
    "comment_keyword": "sentences",
    "comment_text": "Varying your sentence structure is a great way to diversify your writing and to keep your reader interested. Try to include sentences of multiple lengths, structures, and types to keep your writing engaging."
  },
  {
    "group_number": 3,
    "sub-number": 4,
    "group_label": "mechanics",
    "sub_group": "sentences",
    "comment_keyword": "agreement SV",
    "comment_text": "Subject/verb agreement can be an egregious mechanical mistake. Please ensure at all times that the subject of your sentence agrees with its associated verb. In long and complex sentences, make sure that you know who is performing the action so you are certain which verb form to use."
  },
  {
    "group_number": 3,
    "sub-number": 4,
    "group_label": "mechanics",
    "sub_group": "sentences",
    "comment_keyword": "fragments",
    "comment_text": "You have included one or more sentence fragments in your paper. It is important to write in complete sentences. Be aware of this error going forward."
  },
  {
    "group_number": 3,
    "sub-number": 4,
    "group_label": "mechanics",
    "sub_group": "sentences",
    "comment_keyword": "parallel",
    "comment_text": "I have identified one or more errors in parallel structure here. Make sure that when you have comparisons or items in a list, you use the same pattern of words. For example, \"I like to run, hike, and swim,\" not, \"I like to run, to go hiking, and swim."
  },
  {
    "group_number": 3,
    "sub-number": 4,
    "group_label": "mechanics",
    "sub_group": "sentences",
    "comment_keyword": "passive voice",
    "comment_text": "Avoid passive voice. Liven up your writing by ensuring that the objects of your sentences are receiving the action of the verbs. For instance, would you rather hear someone say, \"Why was the road crossed by the chicken?\" or \"Why did the chicken cross the road?"
  },
  {
    "group_number": 3,
    "sub-number": 4,
    "group_label": "mechanics",
    "sub_group": "sentences",
    "comment_keyword": "run-ons",
    "comment_text": "A run-on sentence is a low-level error and one that can make the reader lose faith in you as a writer rather quickly. Make sure you always properly combine independent clauses with a comma and a coordinating conjunction or with a semicolon."
  },
  {
    "group_number": 4,
    "sub-number": 1,
    "group_label": "style",
    "sub_group": "readability",
    "comment_keyword": "readability",
    "comment_text": "You may have good ideas here, but they are lost in your poorly constructed style. Work hard to ensure a high degree of readability, fluency, and flow. You do not want your thoughts to be rendered ineffective by your writing style."
  },
  {
    "group_number": 4,
    "sub-number": 1,
    "group_label": "style",
    "sub_group": "readability",
    "comment_keyword": "cliches",
    "comment_text": "Cliches are uninteresting. Expel the use of cliches from your writing, and avoid the use of colloquialisms so that you do not sound informal or unscholarly."
  },
  {
    "group_number": 4,
    "sub-number": 1,
    "group_label": "style",
    "sub_group": "readability",
    "comment_keyword": "literary present",
    "comment_text": "When writing about literature, use present tense when discussing events from your primary source. This is called the \"literary present.\" It is important because although the book may have been written in the past, the events are treated as though they are currently happening."
  },
  {
    "group_number": 4,
    "sub-number": 1,
    "group_label": "style",
    "sub_group": "readability",
    "comment_keyword": "point of view",
    "comment_text": "Third person is the most effective point of view for writing academic papers. Please avoid using first-person language like I or second-person language like you in formal academic writing."
  },
  {
    "group_number": 4,
    "sub-number": 1,
    "group_label": "style",
    "sub_group": "readability",
    "comment_keyword": "title",
    "comment_text": "The title of your essay will set your essay apart from the rest, so be sure to come up with something creative and exciting. Simply using the title of the assignment is drab and unimaginative and will do nothing to attract the interest of your reader."
  },
  {
    "group_number": 4,
    "sub-number": 1,
    "group_label": "style",
    "sub_group": "readability",
    "comment_keyword": "tone",
    "comment_text": "Tone is one of the most important parts of any essay, so be sure that the tone of your writing is conveying the message you intend. You can control the attitude or tone of your piece by using diction, sentence type, and other stylistic elements correctly and in the manner you desire."
  },
  {
    "group_number": 4,
    "sub-number": 1,
    "group_label": "style",
    "sub_group": "readability",
    "comment_keyword": "voice",
    "comment_text": "The best way to give your essay the stamp of personality is to develop your own unique voice. Infusing your writing with your own individual flair will help to differentiate your writing from that of others."
  },
  {
    "group_number": 4,
    "sub-number": 2,
    "group_label": "style",
    "sub_group": "sentences",
    "comment_keyword": "beginnings",
    "comment_text": "All of your sentences start in a very similar manner. This can leader to inertia and stupor on the part of the reader. To combat this, try to start your sentences with introductory clauses or conjunctive adverbs like \"therefore\" and \"however\" to keep your reader on his or her toes."
  },
  {
    "group_number": 4,
    "sub-number": 2,
    "group_label": "style",
    "sub_group": "sentences",
    "comment_keyword": "length",
    "comment_text": "Your writing would be greatly enhanced by a simple variation in sentence length. When all your sentences are one length, your writing can seem droopy and listless. Keep your reader engaged and on his or her toes by utilizing sentences of different lengths."
  },
  {
    "group_number": 4,
    "sub-number": 2,
    "group_label": "style",
    "sub_group": "sentences",
    "comment_keyword": "transitions",
    "comment_text": "A good way to improve your style would be to improve your transitions. Transitions help to show linkages and connections between ideas. They help to tie your essay together as a whole."
  },
  {
    "group_number": 4,
    "sub-number": 2,
    "group_label": "style",
    "sub_group": "sentences",
    "comment_keyword": "types",
    "comment_text": "One very effective way to enhance your writing style is to vary your sentence structure. Using simple, compound, complex, and compound-complex sentences will help to energize your writing and jolt your reader out of his or her stupor."
  },
  {
    "group_number": 4,
    "sub-number": 3,
    "group_label": "style",
    "sub_group": "quotations",
    "comment_keyword": "quotations",
    "comment_text": "Never simply drop a quote in without analysis, but never analyze a quote by using language like \"This quote says ...\" or \"From this quote, we can see ...\" Integrate your quotes fluidly into your writing, and try to avoid using quotes that are over four lines long. If you do feel you need to use a long quote, paraphrase as much as possible."
  },
  {
    "group_number": 4,
    "sub-number": 3,
    "group_label": "style",
    "sub_group": "quotations",
    "comment_keyword": "appropriate",
    "comment_text": "Read all your quotations carefully. I do not think that all of your quotes mean what you think they mean. Be sure to internalize the meaning of the quotes you intend to use to avoid this common pitfall."
  },
  {
    "group_number": 4,
    "sub-number": 3,
    "group_label": "style",
    "sub_group": "quotations",
    "comment_keyword": "long",
    "comment_text": "Refrain from using long quotes. Quotations that run more than three lines are too long. Break long quotes into smaller nuggets and include them in the natural flow of your writing."
  },
  {
    "group_number": 4,
    "sub-number": 3,
    "group_label": "style",
    "sub_group": "quotations",
    "comment_keyword": "long format",
    "comment_text": "If you include a quote of this length, you need to format that quote properly. Please consult the literature I gave you or the Internet for more specific instructions."
  },
  {
    "group_number": 4,
    "sub-number": 3,
    "group_label": "style",
    "sub_group": "quotations",
    "comment_keyword": "start with",
    "comment_text": "Avoid starting a paragraph or a paper with a quote. All quotes must be properly introduced and explained before you attempt to use them to support your assertions. Make sure the explanation is logical and the context is thoroughly explained before you insert the quote."
  },
  {
    "group_number": 4,
    "sub-number": 3,
    "group_label": "style",
    "sub_group": "quotations",
    "comment_keyword": "weaving",
    "comment_text": "To avoid the awkwardness of simply dropping a quotation on your reader with no context, try to break up a long quote and to weave smaller portions of that quote into parts of your own writing."
  },
  {
    "group_number": 4,
    "sub-number": 4,
    "group_label": "style",
    "sub_group": "format",
    "comment_keyword": "format",
    "comment_text": "Writing your paper in the assigned format is one of the easiest ways to garner points. Being able to read and follow directions is a low-level skill, and one you should have mastered by now. Please make sure to read and follow assignment guidelines carefully in the future."
  },
  {
    "group_number": 4,
    "sub-number": 4,
    "group_label": "style",
    "sub_group": "format",
    "comment_keyword": "font",
    "comment_text": "The MLA paper format requires that you use Times New Roman 12 point font for all text, including your title, heading, page numbers, headers, footer, works cited, and all other paraphernalia. This is an easy requirement to follow. Get it right."
  },
  {
    "group_number": 4,
    "sub-number": 4,
    "group_label": "style",
    "sub_group": "format",
    "comment_keyword": "header",
    "comment_text": "Please remember to include a right-justified header with your last name and the page number on every page."
  },
  {
    "group_number": 4,
    "sub-number": 4,
    "group_label": "style",
    "sub_group": "format",
    "comment_keyword": "heading",
    "comment_text": "Your heading should appear on only the first page of your essay. It should be double-spaced and in the upper-left corner."
  },
  {
    "group_number": 4,
    "sub-number": 4,
    "group_label": "style",
    "sub_group": "format",
    "comment_keyword": "margins",
    "comment_text": "Your margins should be 1-inch all the way around: top, bottom, left, and right."
  },
  {
    "group_number": 4,
    "sub-number": 4,
    "group_label": "style",
    "sub_group": "format",
    "comment_keyword": "spacing p",
    "comment_text": "There is no need for an extra line between paragraphs in your essay. Please press enter only once. If your computer is doing this automatically, please reset Word's settings by going to \"Paragraph\" and adjusting the spacing to \"0 pt.\" Then, please select the option that says, \"Do not add space between paragraphs of the same style.\" This should fix the issue."
  },
  {
    "group_number": 4,
    "sub-number": 4,
    "group_label": "style",
    "sub_group": "format",
    "comment_keyword": "spacing s",
    "comment_text": "Please only include one space between your sentences. Typewriters used to require double spacing after sentences, but in the era of word processors, just one space is necessary."
  },
  {
    "group_number": 4,
    "sub-number": 4,
    "group_label": "style",
    "sub_group": "format",
    "comment_keyword": "title",
    "comment_text": "There is no need to make your title stand out with big, bold, or italic font. Please type it in the same font size and style as the rest of your paper: Times New Roman 12 point font."
  },
  {
    "group_number": 4,
    "sub-number": 4,
    "group_label": "style",
    "sub_group": "format",
    "comment_keyword": "titles (format)",
    "comment_text": "An easy rule of thumb for the italics vs. quotation marks issue is to remember that short works like songs, poems, short stories, and articles are set in quotes, while longer works like books, movies, newspapers, operas, databases, and works of art are put in italics."
  },
  {
    "group_number": 5,
    "sub-number": 1,
    "group_label": "citations",
    "sub_group": "sources",
    "comment_keyword": "sources",
    "comment_text": "I emphasized that one of the biggest aspects of this assignment was to conduct research and include relevant data in your paper. Please do this more effectively. This is an important skill, so take the time to get it right."
  },
  {
    "group_number": 5,
    "sub-number": 1,
    "group_label": "citations",
    "sub_group": "sources",
    "comment_keyword": "internet",
    "comment_text": "The Internet seems like an easy, quick way to do research, but it is not effective for this level of academics. The library contains a multitude of credible and relevant sources, both in print and online. You should almost never cite websites."
  },
  {
    "group_number": 5,
    "sub-number": 1,
    "group_label": "citations",
    "sub_group": "sources",
    "comment_keyword": "quality",
    "comment_text": "Make sure that all the sources you include are reputable and scholarly in nature. Study note websites like Gradesaver, Shmoop, and Spark Notes should never be cited. Find the same information in a better source. Wikipedia and similar sites (Yahoo Answers, etc.) are never acceptable. Aim for peer-reviewed journal articles from the JSTOR database."
  },
  {
    "group_number": 5,
    "sub-number": 1,
    "group_label": "citations",
    "sub_group": "sources",
    "comment_keyword": "types",
    "comment_text": "One of the easiest aspects of this assignment was including the number and type of sources I clearly required. This would have been a great area to pick up points. Please be more conscious of fulfilling this requirement in the future."
  },
  {
    "group_number": 5,
    "sub-number": 2,
    "group_label": "citations",
    "sub_group": "In-text",
    "comment_keyword": "In-text",
    "comment_text": "Your paper had one or more errors in internal citation. This is a big concern because it is a basic skill. Please review the rules of citation to fix this issue for next time."
  },
  {
    "group_number": 5,
    "sub-number": 2,
    "group_label": "citations",
    "sub_group": "In-text",
    "comment_keyword": "needed",
    "comment_text": "You must provide an in-text citation for anything that is NOT common knowledge. Otherwise, you run the risk of plagiarism."
  },
  {
    "group_number": 5,
    "sub-number": 2,
    "group_label": "citations",
    "sub_group": "In-text",
    "comment_keyword": "paraphrase",
    "comment_text": "Quotations are not the only things that need to be cited. LA style requires citations for paraphrases and summaries of work that is not your own. Be sure to do this in the future."
  },
  {
    "group_number": 5,
    "sub-number": 2,
    "group_label": "citations",
    "sub_group": "In-text",
    "comment_keyword": "punctuation",
    "comment_text": "Unless you are including an abbreviation (i.e. ch., par., or bk.) or quoting lines of a poem or play (i.e. Dante 5.33-57), MLA prohibits the use of punctuation within and in-text citation's parentheses. This includes commas and periods, which must fall at the end of the sentence after the citation. For example: Your words, \"quoted text\" (Poe 45)."
  },
  {
    "group_number": 5,
    "sub-number": 2,
    "group_label": "citations",
    "sub_group": "In-text",
    "comment_keyword": "quotes",
    "comment_text": "In-text citations must always fall outside the quotation marks. For example, \"To be or not to be\" (Shakespeare 485)."
  },
  {
    "group_number": 5,
    "sub-number": 3,
    "group_label": "citations",
    "sub_group": "works cited",
    "comment_keyword": "works cited",
    "comment_text": "Your \"Works Cited\" page is one of the elements that can distinguish you as a true scholar. Yours has a few errors, which means that your \"Works Cited\" page did not inspire as much confidence as it could have. To achieve distinction as a real academic, spend more time formatting this page for your next paper."
  },
  {
    "group_number": 5,
    "sub-number": 3,
    "group_label": "citations",
    "sub_group": "works cited",
    "comment_keyword": "alignment",
    "comment_text": "I noticed that on your \"Works Cited\" page, your second and subsequent lines of each entry were not indented. It is an MLA requirement to do this. Be sure to take care of this detail for your next paper."
  },
  {
    "group_number": 5,
    "sub-number": 3,
    "group_label": "citations",
    "sub_group": "works cited",
    "comment_keyword": "anthology",
    "comment_text": "Citing anthologies can be confusing, but just remember to cite the author of the work you are using, not the editor of the anthology in which you found the work."
  },
  {
    "group_number": 5,
    "sub-number": 3,
    "group_label": "citations",
    "sub_group": "works cited",
    "comment_keyword": "MLA 2016",
    "comment_text": "Please be sure to use the most recent form of MLA, the 8th edition (MLA 2016). Check the Owl at Purdue for updated details."
  },
  {
    "group_number": 5,
    "sub-number": 3,
    "group_label": "citations",
    "sub_group": "works cited",
    "comment_keyword": "new page",
    "comment_text": "Please set your \"Works Cited\" page off as its own page, separate from the rest of the essay."
  },
  {
    "group_number": 6,
    "sub-number": 1,
    "group_label": "praise",
    "sub_group": "content",
    "comment_keyword": "analysis",
    "comment_text": "Good work on your analysis. You present the subject clearly and thoroughly from the basics to the details."
  },
  {
    "group_number": 6,
    "sub-number": 1,
    "group_label": "praise",
    "sub_group": "content",
    "comment_keyword": "critical thinking",
    "comment_text": "Your critical thinking here shows a lot of maturity. You have considered all sides to the argument and presented your take effectively. This is a skill that will help you excel beyond our classroom and academia."
  },
  {
    "group_number": 6,
    "sub-number": 1,
    "group_label": "praise",
    "sub_group": "content",
    "comment_keyword": "ideas",
    "comment_text": "Great work on the heart of this. You are very creative, and you communicate your ideas with intellect and insight. I have enjoyed reading your essay."
  },
  {
    "group_number": 6,
    "sub-number": 1,
    "group_label": "praise",
    "sub_group": "content",
    "comment_keyword": "narration",
    "comment_text": "In this narrative, you have really transported me through your adept choice of sensory details. I could retell this as if it happened to me. Fabulous work!"
  },
  {
    "group_number": 6,
    "sub-number": 1,
    "group_label": "praise",
    "sub_group": "content",
    "comment_keyword": "persuasion",
    "comment_text": "Grammar and punctuation aside, your persuasive elements in this piece are commendable. Your solid understanding of rhetoric makes you a charismatic writer, and your audience is bound to see your point of view."
  },
  {
    "group_number": 6,
    "sub-number": 1,
    "group_label": "praise",
    "sub_group": "content",
    "comment_keyword": "MLA",
    "comment_text": "Documentation can be a big pain, but it is extremely important--and you obviously understand that. Your attention to detail with MLA formatting is impressive. Continue using this work ethic in future classes, and you will go far."
  },
  {
    "group_number": 6,
    "sub-number": 3,
    "group_label": "praise",
    "sub_group": "style",
    "comment_keyword": "format",
    "comment_text": "Many students will write a shining essay but neglect the formatting. Your attention to that detail sets you apart from the rest. Thank you for following the guidelines."
  },
  {
    "group_number": 6,
    "sub-number": 3,
    "group_label": "praise",
    "sub_group": "style",
    "comment_keyword": "mechanics",
    "comment_text": "Reading a paper as free of errors as yours is a sincere pleasure. I can tell that you either have a natural eye for mechanics or that you have gone out of your way to proofread your work. This is admirable."
  },
  {
    "group_number": 6,
    "sub-number": 3,
    "group_label": "praise",
    "sub_group": "style",
    "comment_keyword": "creativity",
    "comment_text": "This is an extraordinary example of creativity. You met all the requirements, but then you went a step further by adding your unique take. I am pleased to see that you enjoyed yourself with this. Excellent execution!"
  },
  {
    "group_number": 6,
    "sub-number": 3,
    "group_label": "praise",
    "sub_group": "style",
    "comment_keyword": "effort",
    "comment_text": "It is clear to me that you have worked very hard on this piece, and that is commendable. This much effort on a single project shows integrity and dedication, and I will remember that."
  },
  {
    "group_number": 6,
    "sub-number": 3,
    "group_label": "praise",
    "sub_group": "style",
    "comment_keyword": "originality",
    "comment_text": "You have taken a unique approach to this assignment! As I moved through each paragraph, I wondered what you would say next. Originality like this can come with risks, but you have pulled it off. I encourage you to keep following your instincts."
  },
  {
    "group_number": 6,
    "sub-number": 3,
    "group_label": "praise",
    "sub_group": "style",
    "comment_keyword": "style",
    "comment_text": "You have a rich, fluid, and distinctive style. This piece moves smoothly and with poise. You developed great command of the written word. Wonderful work."
  },
  {
    "group_number": 6,
    "sub-number": 3,
    "group_label": "praise",
    "sub_group": "style",
    "comment_keyword": "voice",
    "comment_text": "Your distinctive voice really shines through in this piece! It is distinctive and enjoyable to read. Establishing a voice is one of the most challenging tasks for writers, so rest assured that this sets you apart."
  }
]